Тестовое_задание/src/Documents/ЗаявкаНаОбслуживание/ЗаявкаНаОбслуживание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаОбслуживание</name>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданаАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаЗакрыта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаявки</name>
    <type>
      <types>EnumRef.СтатусыЗаявок</types>
    </type>
  </attributes>
</mdclass:Document>

Тестовое_задание/src/Enums/СтатусыЗаявок/СтатусыЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаявок</name>
  <enumValues>
    <name>Новая</name>
  </enumValues>
  <enumValues>
    <name>Исполняется</name>
  </enumValues>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
  <enumValues>
    <name>Закрыта</name>
  </enumValues>
</mdclass:Enum>

Тестовое_задание/src/Documents/ЗаявкаНаОбслуживание/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры

&НаСервере
Процедура ЗаявкаЗакрытаПриИзмененииНаСервере()
	Если Объект.ЗаявкаЗакрыта = Истина И Объект.СтатусЗаявки = Перечисления.СтатусыЗаявок.Выполнена Тогда
		Объект.СтатусЗаявки = Перечисления.СтатусыЗаявок.Закрыта;
	Иначе
		Сообщить("Заявка не может быть закрыта, т.к. не все назначенные наряды были выполнены или отменены!");
		Объект.ЗаявкаЗакрыта = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаЗакрытаПриИзменении(Элемент)
	
	ЗаявкаЗакрытаПриИзмененииНаСервере();
	Если Объект.ЗаявкаЗакрыта = Истина Тогда
		Элементы.Группа1.ТолькоПросмотр = Истина;
		Элементы.Клиент.ТолькоПросмотр = Истина;
		Элементы.Описание.ТолькоПросмотр = Истина;
	Иначе
		Элементы.Группа1.ТолькоПросмотр = Ложь;
		Элементы.Клиент.ТолькоПросмотр = Ложь;
		Элементы.Описание.ТолькоПросмотр = Ложь;
	КонецЕсли;
КонецПроцедуры
